#+TITLE: Análise de Sentimento das Atas do Compom
#+AUTHOR: Gabriel Petrini
#+DATE: 2º Semestre de 2020
#+LANG: pt_Br
#+PROPERTY: header-args:R  :session *R* :results output replace :exports both :eval no-export :tangle no
* Baixando atas

#+begin_src R
library(tidyverse)

download_ata <- function(n_ata = 200) {
  url = paste0("http://www.bcb.gov.br/?COPOM", n_ata)
  if (n_ata < 200) {
    destfile = paste0("./atas/copom_", n_ata, ".htm")
  } else {
    destfile = paste0("./atas/copom_", n_ata, ".pdf")
  }
  download.file(url = url,
                destfile = destfile,
                mode = "wb",
                extra = '-L')
}


seq(from = 21, to = 212) %>% map(download_ata)
#+end_src

#+RESULTS:
: Erro: package or namespace load failed for ‘tidyverse’ in dyn.load(file, DLLpath = DLLpath, ...):
:  impossível carregar objeto compartilhado '/home/gpetrini/R/x86_64-pc-linux-gnu-library/3.6/stringi/libs/stringi.so':
:   libicui18n.so.60: não é possível abrir arquivo compartilhado: Arquivo ou diretório não encontrado
: Error in seq(from = 21, to = 212) %>% map(download_ata) : 
:   não foi possível encontrar a função "%>%"

